updated readme and renamed test file
